DataProcessors/АРМПриемВозвратныхСчетФактурСТАРШИМВОДИТЕЛЕМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>АРМПриемВозвратныхСчетФактурСТАРШИМВОДИТЕЛЕМ</Name>
			<Comment>Прием возвратных счет фактур СТАРШИМ ВОДИТЕЛЕМ</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ВозвратнаяСчетФактура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВозвратнаяСчетФактура</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВоздушка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетфактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отгрузка</Name>
					<Comment>ПереданоНаОтгрузку(Документ передан В Общую Базу Отрузки)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диспетчер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДВПриемаДиспетчером</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтаршийВодитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДВПриемаСтаршимВодителем</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распечатано</Name>
					<Comment>Счет Фактуры Распечатаны</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДВПриемаВодителем</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПутевойЛист_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/АРМПриемВозвратныхСчетФактурСТАРШИМВОДИТЕЛЕМ/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	      
	
	Если Источник = "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
		ШК = Лев(Данные, 12);	
		 Если ЗначениеЗаполнено(ШК) Тогда
			 //Поиск Возвратной СчетФ
			 ШКПриИзменении(Элементы.ШК); 			  
		 КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция  НайтиДокументПоШК(ШК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратнаяСчетФактура.Ссылка
		|ИЗ
		|	Документ.ВозвратнаяСчетФактура КАК ВозвратнаяСчетФактура
		|ГДЕ
		|	ВозвратнаяСчетФактура.ШК = &ШК
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВозвратнаяСчетФактура.Дата УБЫВ";

	Запрос.УстановитьПараметр("ШК", ШК);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат  ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	

КонецФункции

&НаКлиенте
Процедура ШКПриИзменении(Элемент)
     ШКПриИзмененииСЕРВЕР();
 КонецПроцедуры
		  
&НаСервере
Процедура ШКПриИзмененииСЕРВЕР()
	//ШКДок = Лев(ШК, СтрДлина(ШК) - 1);
	ШКДок = ШК;
	Док=НайтиДокументПоШК(ШКДок);
			  Если ЗначениеЗаполнено(Док) Тогда
				 //Документ Найден
				
				 //Приемка диспетчером
				 Если ЗначениеЗаполнено(Док.ДВПриемаСтаршимВодителем) Тогда
					Сообщить("Документ СФ - "+Док.НомерСчетфактуры + " уже принят СТАРШИМ ВОДИТЕЛЕМ.");	 
				 Иначе	 
				 ДокОбъект=Док.ПолучитьОбъект();
				 ДокОбъект.ДВПриемаСтаршимВодителем=ТекущаяДата();
				 ДокОбъект.СтаршийВодитель=ИмяПользователя();
				 ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				 Сообщить("Документ найден СФ -"+Док.НомерСчетфактуры + " и принят СТАРШИМ ВОДИТЕЛЕМ");
                 КонецЕсли;
			 Иначе
				 Сообщить("Документ не найден.");
			  КонецЕсли;

			  //Элементы.ВозвратныеСФнеПринятыеДиспетчером.Обновить();
			  Элементы.ВозвратныеСФПринятыеДиспетчером.Обновить();
			  Элементы.ВозвратныеСФПринятыеСТАРШИМВОДИТЕЛЕМ.Обновить();
КонецПроцедуры


&НаКлиенте
Процедура ПринятьВыделенныеСФ(Команда)
	Если Вопрос("Принять выделенные Счет Фактуры?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
	Возврат;	
КонецЕсли;

	
	масИД=Элементы.ВозвратныеСФПринятыеДиспетчером.ВыделенныеСтроки;
	Если масИД.Количество()=0 Тогда
		Сообщить("Ничего не выбрано.");
		Возврат;
	КонецЕсли;
	
	масДок=Новый Массив;
	
	Для Каждого эл_масИД Из масИД Цикл
		//Сообщить(Элементы.СписокДокВПутевыхЛистах.ДанныеСтроки(эл_масИД).ПутевойЛист);
	масДок.Добавить(Элементы.ВозвратныеСФПринятыеДиспетчером.ДанныеСтроки(эл_масИД).Ссылка);	
	КонецЦикла;
	ПринятьВыделенныеСФСервер(масДок);
	 
			//Элементы.ВозвратныеСФнеПринятыеДиспетчером.Обновить();
			  Элементы.ВозвратныеСФПринятыеДиспетчером.Обновить();
			  Элементы.ВозвратныеСФПринятыеСТАРШИМВОДИТЕЛЕМ.Обновить();

КонецПроцедуры
		  
&НаСервере
Процедура ПринятьВыделенныеСФСервер(масДок)
	
	Для Каждого эл_масДок Из масДок Цикл
		Док=эл_масДок.ПолучитьОбъект();
		Док.СтаршийВодитель=ИмяПользователя();
		Док.ДВПриемаСтаршимВодителем=ТекущаяДата();
		Док.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("Документ принят Старшим Водителем.");
	КонецЦикла;
	
		
КонецПроцедуры


&НаКлиенте
Процедура УбратьОтметкуТекущейСтроки()
			//Элементы.ВозвратныеСФнеПринятыеДиспетчером.ТекущаяСтрока=-1;
			  //Элементы.ВозвратныеСФПринятыеДиспетчером.ТекущаяСтрока=-1;
			  //Элементы.ВозвратныеСФПринятыеСТАРШИМВОДИТЕЛЕМ.ТекущаяСтрока=-1;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УбратьОтметкуТекущейСтроки();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеСФ(Команда)
	//Удаляем Отбор
//---------------------- ВОЗВР. СФ ПРИНЯТЫЕ ВОДИТЕЛЯМИ ----------//
	
	ЭлементыОтбора=ВозвратныеСФПринятыеВодителями.Отбор.Элементы;
	Кол=ЭлементыОтбора.Количество();
	Для Н=1 По Кол Цикл
		ЭлементыОтбора.Удалить(Кол-Н);	
	КонецЦикла;
	
	
	новыйЭлемент=ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	новыйЭлемент.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДВПриемаВодителем");
	новыйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.НеРавно;
	новыйЭлемент.ПравоеЗначение=Дата(1,1,1);
	
//---------------------- ВОЗВР. СФ ПРИНЯТЫЕ ВОДИТЕЛЯМИ ----------//
	
	ЭлементыОтбора=ВозвратныеСФПринятыеСТАРШИМВОДИТЕЛЕМ.Отбор.Элементы;
	Кол=ЭлементыОтбора.Количество();
	Для Н=1 По Кол Цикл
		ЭлементыОтбора.Удалить(Кол-Н);	
	КонецЦикла;
	
	
	новыйЭлемент=ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	новыйЭлемент.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДВПриемаСтаршимВодителем");
	новыйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.Больше;
	новыйЭлемент.ПравоеЗначение=Дата(2014,03,21); // Начало Нововведения
	
	новыйЭлемент=ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	новыйЭлемент.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДВПриемаВодителем");
	новыйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.НеЗаполнено;

	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСФЗаСегодня(Команда)
	
	
	//---------------------- ВОЗВР. СФ ПРИНЯТЫЕ ВОДИТЕЛЯМИ ----------//
	
	ЭлементыОтбора=ВозвратныеСФПринятыеВодителями.Отбор.Элементы;
	Кол=ЭлементыОтбора.Количество();
	Для Н=1 По Кол Цикл
		ЭлементыОтбора.Удалить(Кол-Н);	
	КонецЦикла;
	
	//Добавляем Отбор
	новыйЭлемент=ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	новыйЭлемент.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДВПриемаВодителем");
	новыйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	новыйЭлемент.ПравоеЗначение=НачалоДня(ТекущаяДата());
	
	новыйЭлемент=ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	новыйЭлемент.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДВПриемаВодителем");
	новыйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	новыйЭлемент.ПравоеЗначение=КонецДня(ТекущаяДата());
	
	//---------------------- ВОЗВР. СФ ПРИНЯТЫЕ СТАРШИМ ВОДИТЕЛЕМ ----------//
	
	ЭлементыОтбора=ВозвратныеСФПринятыеСТАРШИМВОДИТЕЛЕМ.Отбор.Элементы;
	Кол=ЭлементыОтбора.Количество();
	Для Н=1 По Кол Цикл
		ЭлементыОтбора.Удалить(Кол-Н);	
	КонецЦикла;
	
	//Добавляем Отбор
	новыйЭлемент=ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	новыйЭлемент.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДВПриемаСтаршимВодителем");
	новыйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	новыйЭлемент.ПравоеЗначение=НачалоДня(ТекущаяДата());
	
	новыйЭлемент=ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	новыйЭлемент.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДВПриемаСтаршимВодителем");
	новыйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	новыйЭлемент.ПравоеЗначение=КонецДня(ТекущаяДата());
	
	новыйЭлемент=ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	новыйЭлемент.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДВПриемаВодителем");
	новыйЭлемент.ВидСравнения=ВидСравненияКомпоновкиДанных.НеЗаполнено;
	//новыйЭлемент.ПравоеЗначение=КонецДня(ТекущаяДата());
	
	
КонецПроцедуры
